app/controllers/documents_controller.rb

  def download
    doc=Document.find(params[:id])
    if doc.message.order.user==current_user || current_user.admin?
---
SELECT * FROM `documents` WHERE (`documents`.`id` = 1)
SELECT * FROM `messages` WHERE (`messages`.`id` = 1) ORDER BY created_at desc
SELECT * FROM `orders` WHERE (`orders`.`id` = 1) ORDER BY created_at desc
SELECT * FROM `users` WHERE (`users`.`id` = 1)