app/controllers/orders_controller.rb

SELECT * FROM `order_types`
---
  def new
     @title="Новый заказ"
     @order=Order.new
     @order.order_type_id=params[:order_type_id].to_i if params[:order_type_id]

SELECT * FROM `order_types`
INSERT INTO `messages` (`created_at`, `body`, `author`, `order_id`, `updated_at`, `user_id`, `status`) VALUES('2009-05-27 07:49:17', 'Я не люблю писать одинаковый код много раз, тем более тривиальный. Я не люблю писать админки для Rails-приложений, потому что они состоят по большей части как раз из такого кода. И я не люблю генераторы, создающие кучу кода, который необходимо менять только в некоторых местах (поэтому для аутентификации я использую AuthLogic, а не restful_authentication).', NULL, 6, '2009-05-27 07:49:17', 2, NULL)
INSERT INTO `orders` (`price`, `created_at`, `updated_at`, `user_id`, `payment`, `order_type_id`, `status`) VALUES(NULL, '2009-05-26 13:59:11', '2009-05-26 13:59:11', NULL, NULL, 1, NULL)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
---
  def create
    if params_posted?(:order)
       @order=Order.new(params[:order])
       @order.user=current_user
       @order.price=@order.order_type.price
       @order.status_id=1
       @order.messages[0].user=current_user
       if @order.save
          OrderMailer.deliver_inform(@order, 'ooo_ekka@mail.ru')
          OrderMailer.deliver_confirm(@order) unless @order.user.email.empty?

SELECT * FROM `statuses` WHERE (`statuses`.`id` = 1)
SELECT * FROM `orders` WHERE (status_id=1) ORDER BY created_at desc LIMIT 0, 20
SELECT * FROM `statuses`
---
  def index
     @title="Заказы"

     if params[:status]
       @status=Status.find(params[:status].to_i)
       conditions=['status_id=?',@status.id]
     else
       conditions=''
     end

    @orders=Order.paginate(:conditions=>conditions, :page=>params[:page], :per_page=>20)
    @statuses=Status.all

SELECT * FROM `orders` WHERE (`orders`.`id` = 1) ORDER BY created_at desc
---
  def show
    @order=Order.find(params[:id])

SELECT * FROM `orders` WHERE (`orders`.`id` = 3) ORDER BY created_at desc
SELECT * FROM `statuses` WHERE (`statuses`.`id` = 2)
UPDATE `orders` SET `updated_at` = '2009-05-28 17:45:02', `status_id` = 2 WHERE `id` = 3
---
  def change_status
     order=Order.find(params[:id])
     status=Status.find(params[:status])
     order.status=status
     if order.save