app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`name`, `last_request_at`, `created_at`, `crypted_password`, `updated_at`, `admin`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `last_login_at`, `email`) VALUES('Дмитрий', '2009-05-28 16:31:39', '2009-05-28 16:31:39', '5357d0a61c72bc33b36bf62803220ab5d281c4f6f1450a3479e307fccb52b7f8ab7e4b1daffa1ab9d572e91971f444f6e8c963c4e950f104320f2b7256c5729c', '2009-05-28 16:31:39', NULL, '127.0.0.1', 'NGi2IdC5D7WTHYo1JatW', '2009-05-28 16:31:39', 'e516f4fae18d088a2940450da568c114d069c82b87ad4e32b5ea5e2c0c8f8644ec87ce9845ac58bfc05585cee32606ea81689ec6267c20361908f115232635ca', 1, NULL, NULL, 'kukhl@mail.ru')

  def index
    @title="Пользователи"
    @users=User.paginate(:page=>params[:page], :per_page=>20)
---
SELECT * FROM `users` LIMIT 0, 20

  def edit
    @title="Настройка пользователя"
    if current_user.supervisor?
      @user=User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1

  def update
    if current_user.supervisor?
      @user=User.find(params[:id])
    else
      @user= @current_user
    end

    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
UPDATE `users` SET `updated_at` = '2009-05-27 08:44:33', `crypted_password` = 'c81b789f0ea42ad113fd15817374768d112feb0c4b70e90b9ec61b4bfe477513d1de139ac596c176b7048e6da24ce6ec6618c1558e27ddb4d310619910988251', `last_login_at` = '2009-05-27 07:48:53', `last_login_ip` = '127.0.0.1', `current_login_at` = '2009-05-27 08:44:33', `password_salt` = 'YNBGl7VADxMya-EcIQVm', `login_count` = 2, `persistence_token` = '2a898caaf03b4b9659fa5b3c80f976c6c12dbac9575675df7fd0ec17e1830e4931973ca78a053239701af7cfb060b2104b5b53fa777784ec81f77526afe9a9f0', `last_request_at` = '2009-05-27 08:44:33' WHERE `id` = 2

  def account
    @title="Личный кабинет"
    @status=params[:status]
    @statuses=Status.all
    if @status=="old"
      conditions='status_id>3'
    else
      conditions='status_id<4'
    end
    @user = @current_user
    @orders=@user.orders.find(:all, :conditions=>conditions)
---
SELECT * FROM `orders` WHERE (`orders`.user_id = 1 AND (status_id>3)) ORDER BY created_at desc